In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'name':['Adam', 'Bob', 'Dave', 'Fred'],
                  'age': [15, 16, 16, 15],
                  'test1': [95, 81, 89, None],
                  'test2': [80, 82, 84, 88],
                  'teacher': ['Ashby', 'Ashby', 'Jones', 'Jones']})

In [3]:
df

   age  name teacher  test1  test2
0   15  Adam   Ashby   95.0     80
1   16   Bob   Ashby   81.0     82
2   16  Dave   Jones   89.0     84
3   15  Fred   Jones    NaN     88

## More Grouping

In [4]:
g = df.groupby('teacher')
g

In [5]:
df.groupby('teacher').apply(max)

         age  name teacher  test1  test2
teacher
Ashby     16   Bob   Ashby   95.0     82
Jones     16  Fred   Jones   89.0     88

In [6]:
df.groupby('teacher').max()

         age  name  test1  test2
teacher
Ashby     16   Bob   95.0     82
Jones     16  Fred   89.0     88

In [7]:
df.groupby('age').apply(len)

age
15    2
16    2
dtype: int64

In [41]:
def best_teacher(g):
    
    x = pd.DataFrame({'test1': [g.loc[g.test1.idxmax()].teacher],
                        'test2': [g.loc[g.test2.idxmax()].teacher]})    
    return x
    
y = df.groupby('age').apply(best_teacher)
y.index = y.index.droplevel(1)
y

     test1  test2
age
15   Ashby  Jones
16   Jones  Jones

In [15]:
type(df.loc[df.test1.idxmax()])

pandas.core.series.Series

In [19]:
df.test2.idxmax()

3